QUE1:

In [ ]:
import pandas as pd
data={"refund":["yes","no","no","yes","no","no","yes","no","no","no"],"martial status":["single","married","single",
"married","divorced","married","divorced","single","married","single"],"taxable income":["125k","100k","70k","120k",
"95k","60k","220k","85k","75k","90k"],"cheat":["no","no","no","no","yes","no","no","yes","no","yes"]}
df=pd.DataFrame(data)
print(df)

  refund martial status taxable income cheat
0    yes         single           125k    no
1     no        married           100k    no
2     no         single            70k    no
3    yes        married           120k    no
4     no       divorced            95k   yes
5     no        married            60k    no
6    yes       divorced           220k    no
7     no         single            85k   yes
8     no        married            75k    no
9     no         single            90k   yes

QUE2:

In [ ]:
print(df.iloc[[0,4,7,8]])

  refund martial status taxable income cheat
0    yes         single           125k    no
4     no       divorced            95k   yes
7     no         single            85k   yes
8     no        married            75k    no

QUE3:

In [ ]:
print(df.iloc[3:8])

  refund martial status taxable income cheat
3    yes        married           120k    no
4     no       divorced            95k   yes
5     no        married            60k    no
6    yes       divorced           220k    no
7     no         single            85k   yes

In [ ]:
print(df.iloc[4:9,1:4])

  martial status taxable income cheat
4       divorced            95k   yes
5        married            60k    no
6       divorced           220k    no
7         single            85k   yes
8        married            75k    no

In [ ]:
print(df.iloc[:,0:3])

  refund martial status taxable income
0    yes         single           125k
1     no        married           100k
2     no         single            70k
3    yes        married           120k
4     no       divorced            95k
5     no        married            60k
6    yes       divorced           220k
7     no         single            85k
8     no        married            75k
9     no         single            90k

QUE4.

In [ ]:
df=pd.read_csv('/content/Iris.csv')
print(df.head(5))

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

QUE5.

In [ ]:
df.drop(df.columns[3],axis=1,inplace=True)
df.drop(4,axis=0,inplace=True)
print(df)

      Id  SepalLengthCm  SepalWidthCm  PetalWidthCm         Species
0      1            5.1           3.5           0.2     Iris-setosa
1      2            4.9           3.0           0.2     Iris-setosa
2      3            4.7           3.2           0.2     Iris-setosa
3      4            4.6           3.1           0.2     Iris-setosa
5      6            5.4           3.9           0.4     Iris-setosa
..   ...            ...           ...           ...             ...
145  146            6.7           3.0           2.3  Iris-virginica
146  147            6.3           2.5           1.9  Iris-virginica
147  148            6.5           3.0           2.0  Iris-virginica
148  149            6.2           3.4           2.3  Iris-virginica
149  150            5.9           3.0           1.8  Iris-virginica

[149 rows x 5 columns]

QUE6.

In [ ]:
employees={"employee id":[101,102,103,104,105],"name":["alice","bob","charlie","diana","edward"],"department":["hr","it","it",
          "marketing","sales"],"age":[39,34,41,28,38],"salary":[50000,70000,65000,55000,60000],"experience":[4,8,10,3,12],"joining_date":
           ["2020-03-15","2017-07-19","2013-06-01","2021-02-10","2010-11-25"],"gender":["female","male","male","female","male"],"bonus":[
               5000,7000,6000,4500,5000],"ratings":[4.5,4.0,3.8,4.7,3.5]}
df=pd.DataFrame(employees)
print(df)

   employee id     name department  age  salary  experience joining_date  \
0          101    alice         hr   39   50000           4   2020-03-15
1          102      bob         it   34   70000           8   2017-07-19
2          103  charlie         it   41   65000          10   2013-06-01
3          104    diana  marketing   28   55000           3   2021-02-10
4          105   edward      sales   38   60000          12   2010-11-25

   gender  bonus  ratings
0  female   5000      4.5
1    male   7000      4.0
2    male   6000      3.8
3  female   4500      4.7
4    male   5000      3.5

In [ ]:
print(df.shape)

(5, 10)

In [ ]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   employee id   5 non-null      int64
 1   name          5 non-null      object
 2   department    5 non-null      object
 3   age           5 non-null      int64
 4   salary        5 non-null      int64
 5   experience    5 non-null      int64
 6   joining_date  5 non-null      object
 7   gender        5 non-null      object
 8   bonus         5 non-null      int64
 9   ratings       5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes
None

In [ ]:
print(df.describe())

       employee id        age       salary  experience   bonus   ratings
count     5.000000   5.000000      5.00000    5.000000     5.0  5.000000
mean    103.000000  36.000000  60000.00000    7.400000  5500.0  4.100000
std       1.581139   5.147815   7905.69415    3.847077  1000.0  0.494975
min     101.000000  28.000000  50000.00000    3.000000  4500.0  3.500000
25%     102.000000  34.000000  55000.00000    4.000000  5000.0  3.800000
50%     103.000000  38.000000  60000.00000    8.000000  5000.0  4.000000
75%     104.000000  39.000000  65000.00000   10.000000  6000.0  4.500000
max     105.000000  41.000000  70000.00000   12.000000  7000.0  4.700000

In [ ]:
print(df.head(5))
print(df.tail(3))

   employee id     name department  age  salary  experience joining_date  \
0          101    alice         hr   39   50000           4   2020-03-15
1          102      bob         it   34   70000           8   2017-07-19
2          103  charlie         it   41   65000          10   2013-06-01
3          104    diana  marketing   28   55000           3   2021-02-10
4          105   edward      sales   38   60000          12   2010-11-25

   gender  bonus  ratings
0  female   5000      4.5
1    male   7000      4.0
2    male   6000      3.8
3  female   4500      4.7
4    male   5000      3.5
   employee id     name department  age  salary  experience joining_date  \
2          103  charlie         it   41   65000          10   2013-06-01
3          104    diana  marketing   28   55000           3   2021-02-10
4          105   edward      sales   38   60000          12   2010-11-25

   gender  bonus  ratings
2    male   6000      3.8
3  female   4500      4.7
4    male   5000      3.5

In [ ]:
print(df["salary"].mean())

60000.0

In [ ]:
print(df["bonus"].sum())

27500

In [ ]:
print(df["age"].min())

28

In [ ]:
print(df["ratings"].max())

4.7

In [ ]:
df.sort_values(by="salary",ascending=False,inplace=True)
print(df)

   employee id     name department  age  salary  experience joining_date  \
1          102      bob         it   34   70000           8   2017-07-19
2          103  charlie         it   41   65000          10   2013-06-01
4          105   edward      sales   38   60000          12   2010-11-25
3          104    diana  marketing   28   55000           3   2021-02-10
0          101    alice         hr   39   50000           4   2020-03-15

   gender  bonus  ratings
1    male   7000      4.0
2    male   6000      3.8
4    male   5000      3.5
3  female   4500      4.7
0  female   5000      4.5

In [ ]:
df['category']='other'

In [ ]:
list1=[]
for i in df["ratings"]:
  if i>=4.5:
    list1.append("excellent")
  elif i>=4.0 and i<4.5:
    list1.append("good")
  else:
    list1.append("good")
print(list1)
df['rating_category']=list1
print(df)

['good', 'good', 'good', 'excellent', 'excellent']
   employee id     name department  age  salary  experience joining_date  \
1          102      bob         it   34   70000           8   2017-07-19
2          103  charlie         it   41   65000          10   2013-06-01
4          105   edward      sales   38   60000          12   2010-11-25
3          104    diana  marketing   28   55000           3   2021-02-10
0          101    alice         hr   39   50000           4   2020-03-15

   gender  bonus  ratings category rating_category
1    male   7000      4.0    other            good
2    male   6000      3.8    other            good
4    male   5000      3.5    other            good
3  female   4500      4.7    other       excellent
0  female   5000      4.5    other       excellent

In [ ]:
print(df.isnull())

   employee id   name  department    age  salary  experience  joining_date  \
1        False  False       False  False   False       False         False
2        False  False       False  False   False       False         False
4        False  False       False  False   False       False         False
3        False  False       False  False   False       False         False
0        False  False       False  False   False       False         False

   gender  bonus  ratings  category  rating_category
1   False  False    False     False            False
2   False  False    False     False            False
4   False  False    False     False            False
3   False  False    False     False            False
0   False  False    False     False            False

In [ ]:
df = df.rename(columns={'employee id': 'id'})
print(df)

    id     name department  age  salary  experience joining_date  gender  \
1  102      bob         it   34   70000           8   2017-07-19    male
2  103  charlie         it   41   65000          10   2013-06-01    male
4  105   edward      sales   38   60000          12   2010-11-25    male
3  104    diana  marketing   28   55000           3   2021-02-10  female
0  101    alice         hr   39   50000           4   2020-03-15  female

   bonus  ratings category rating_category
1   7000      4.0    other            good
2   6000      3.8    other            good
4   5000      3.5    other            good
3   4500      4.7    other       excellent
0   5000      4.5    other       excellent

In [ ]:
x=df.loc[df['experience']>5]
print(x)
print('\n')
y=df.loc[df['department']=='it']
print(y)

    id     name department  age  salary  experience joining_date gender  \
1  102      bob         it   34   70000           8   2017-07-19   male
2  103  charlie         it   41   65000          10   2013-06-01   male
4  105   edward      sales   38   60000          12   2010-11-25   male

   bonus  ratings category rating_category
1   7000      4.0    other            good
2   6000      3.8    other            good
4   5000      3.5    other            good


    id     name department  age  salary  experience joining_date gender  \
1  102      bob         it   34   70000           8   2017-07-19   male
2  103  charlie         it   41   65000          10   2013-06-01   male

   bonus  ratings category rating_category
1   7000      4.0    other            good
2   6000      3.8    other            good

In [ ]:
list1=[]
for i in df['salary']:
  list1.append(0.1*i)
df['tax']=list1
print(df)

    id     name department  age  salary  experience joining_date  gender  \
1  102      bob         it   34   70000           8   2017-07-19    male
2  103  charlie         it   41   65000          10   2013-06-01    male
4  105   edward      sales   38   60000          12   2010-11-25    male
3  104    diana  marketing   28   55000           3   2021-02-10  female
0  101    alice         hr   39   50000           4   2020-03-15  female

    bonus  ratings category rating_category     tax
1  7000.0      4.0    other            good  7000.0
2  6500.0      3.8    other            good  6500.0
4  6000.0      3.5    other            good  6000.0
3  5500.0      4.7    other       excellent  5500.0
0  5000.0      4.5    other       excellent  5000.0

In [ ]:
df.to_csv('employee_data.csv')